Determination of Income and Expenditure.tex
% Created 2022-01-21 Fri 12:28
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Krishna Jani}
\date{\today}
\title{Determination of Income and Employment}
\hypersetup{
 pdfauthor={Krishna Jani},
 pdftitle={Determination of Income and Employment},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.0.91 (Org mode 9.5.2)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\section{Ceteris Peribus}
\label{sec:org86a2d64}
\begin{itemize}
\item \emph{Ceteris peribus} is a Latin term which means "All other factors remaining constant"
\item Macroeconomics consists of different models which are used to explain changes in an economy but because the economy itself is influenced by many different variables it becomes difficult for economists to take consideration of all these variables
\item Thus when talking about one perticular variable economists consider other variables to be constant which is called as ceteris peribus.
\end{itemize}

\section{Kenyes Economics}
\label{sec:org873fc21}
The macroeconomics of Kenyes is based on  \href{General Theory Kenyes.org}{General Theory} which is also the basis of the entire AD/AS concept

\subsection{Ex post and Ex ante values}
\label{sec:org80c4591}
\begin{itemize}
\item Ex post values are actuall accounting values, eg: Consumption = 200 utils or 10\$. This is a cardinal value and represents the consumption done in real life
\item Ex ante values on the other hand are values which the producers plan and  approximate
\item The values that we will be using in consequtive topics will be Ex Ante values
\end{itemize}

\section{Consumption Function}
\label{sec:orgb7f39b8}
\begin{itemize}
\item A consumption function provides the relation between consumption and income
\item The function assumes that the changes in consumption are at a constant rate with the changes in Income
\item But it also takes into acccount that there is consumption when there is no income, it is the minimum ammount of consumption a society needs to servive and thus is called as \textbf{autonomous} consumption which is denoted by \(\bar{C}\)
\item Thus the function can be described as :

$$
  C = \bar{C} + cY
  $$

\item In this function we can see that
\begin{itemize}
\item C = Consumption

\item \(\bar{C}\) = Autonomous Consumption

\item cY = Induced Consumption
\end{itemize}
\item The expression "cY" represents the dependence of consumption on income "Y"
\begin{itemize}
\item Here "c" refers to MPC (Marginal Propensity to Consume)
\end{itemize}
\end{itemize}

\subsection{MPC}
\label{sec:orge3fc00b}
\begin{itemize}
\item MPC - Marginal Propensity to Consume and it refers to the change in Consumption when there is a change in Income
\item It thus is represented by

$$
  MPC = \frac{\delta C}{\delta Y}
  $$

\begin{itemize}
\item Where the numerator represents the change in Consumption

\item And denominator represents the change of income "Y"
\end{itemize}
\item \textbf{MPC can either be 0 in value or 1 but cannot exceed 1}
\begin{itemize}
\item It can be 0 because a consumer may choose to put all of his income in savings and keep the consumption constant

\item It can also be 1 because a consumer may choose to put all of his income in the consumption

\item It cannot exceed because one cannot consume more than what he can afford
\end{itemize}
\item \textbf{For Example}
\begin{itemize}
\item If the MPC of a state is \(C = 100 + 0.7Y\)

\item This it means that whenever there is an increase of 10 \$ in the income of the state, it leads to a 0.7 increase in consumption which would be 7 \$. Thus Consumption would be =  100 + 0.7 * 10 = 107
\end{itemize}
\end{itemize}

\section{Savings Function}
\label{sec:orgcbe4f8d}
\begin{itemize}
\item It is simply according to \href{General Theory Kenyes.org}{General Theory} the part of income which is not engaged in consumption and investment (also considered as a form of consumption). It is thus written as

$$
  S = Y - C
  $$

\begin{itemize}
\item Which is Savings (S) = Income (Y) - Consumption (C)
\end{itemize}

\item Similarly when considering MPS we can say that MPS (Marginal Propensity to Save) is

$$
  MPS = \frac{\delta S}{\delta Y}
  $$

Similar to the Consumption function mentioned above

\item MPS can also be defined as \(= 1 - c\) where "c" is MPC as mentioned in the consumption function
\begin{itemize}
\item This is because

$$
    MPS = \frac{\Delta S}{\Delta Y}
    MPS = \frac{\Delta (Y - C)}{\Delta Y}
    MPS = \frac{\Delta Y}{\Delta Y} - \frac{\Delta C}{\Delta Y}
    MPS = 1 - MPC
    MPS = 1 - c
    $$
\end{itemize}
\end{itemize}
\end{document}